NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/bootloader/src/mesh_aci.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <string.h>
#include "mesh_aci.h"
#include "rbc_mesh_common.h"

#include "serial_handler.h"
#include "event_handler.h"
#include "version.h"
#include "mesh_packet.h"
#include "rtt_log.h"

#ifdef BOOTLOADER
#include "transport.h"
#include "bootloader.h"
#else
#ifdef MESH_DFU
#include "dfu_app.h"
#include "dfu_types_mesh.h"
#endif
#endif

#if (NORDIC_SDK_VERSION >= 11)
#include "nrf_nvic.h"
#endif

/* event push isn't present in the API header file. */
extern uint32_t rbc_mesh_event_push(rbc_mesh_event_t* p_evt);

/*****************************************************************************
 * Static functions
 *****************************************************************************/

static aci_status_code_t error_code_translate(uint32_t nrf_error_code)
{
    switch (nrf_error_code)
    {
        case NRF_SUCCESS:                      return ACI_STATUS_SUCCESS;
        case NRF_ERROR_SVC_HANDLER_MISSING:    return ACI_STATUS_ERROR_DEVICE_STATE_INVALID;
        case NRF_ERROR_SOFTDEVICE_NOT_ENABLED: return ACI_STATUS_ERROR_DEVICE_STATE_INVALID;
        case NRF_ERROR_INTERNAL:               return ACI_STATUS_ERROR_UNKNOWN;
        case NRF_ERROR_NO_MEM:                 return ACI_STATUS_ERROR_BUSY;
        case NRF_ERROR_NOT_FOUND:              return ACI_STATUS_ERROR_PIPE_INVALID;
        case NRF_ERROR_NOT_SUPPORTED:          return ACI_STATUS_ERROR_CMD_UNKNOWN;
        case NRF_ERROR_INVALID_PARAM:          return ACI_STATUS_ERROR_INVALID_PARAMETER;
        case NRF_ERROR_INVALID_STATE:          return ACI_STATUS_ERROR_DEVICE_STATE_INVALID;
        case NRF_ERROR_INVALID_LENGTH:         return ACI_STATUS_ERROR_INVALID_LENGTH;
        case NRF_ERROR_INVALID_FLAGS:          return ACI_STATUS_ERROR_INVALID_PARAMETER;
        case NRF_ERROR_INVALID_DATA:           return ACI_STATUS_ERROR_INVALID_PARAMETER;
        case NRF_ERROR_DATA_SIZE:              return ACI_STATUS_ERROR_INVALID_LENGTH;
        case NRF_ERROR_TIMEOUT:                return ACI_STATUS_ERROR_UNKNOWN;
        case NRF_ERROR_NULL:                   return ACI_STATUS_ERROR_INVALID_PARAMETER;
        case NRF_ERROR_FORBIDDEN:              return ACI_STATUS_ERROR_BUSY;
        case NRF_ERROR_INVALID_ADDR:           return ACI_STATUS_ERROR_INVALID_PARAMETER;
        case NRF_ERROR_BUSY:                   return ACI_STATUS_ERROR_BUSY;
        default:                               return ACI_STATUS_ERROR_UNKNOWN;
    }
}

/**
 * Handle events coming in on the serial line
 */
static void serial_command_handler(serial_cmd_t* p_serial_cmd)
{
#ifdef RTT_LOG
    __LOG("Serial RX: ");
    uint8_t* p = ((uint8_t*) p_serial_cmd);
    for (uint32_t i = 0; i <= p_serial_cmd->length; ++i)
    {
        __LOG("%02x", p[i]);
    }
    __LOG("\n");
#endif
    serial_evt_t serial_evt;
    uint32_t error_code;
    switch (p_serial_cmd->opcode)
    {
        case SERIAL_CMD_OPCODE_ECHO:
            serial_evt.opcode = SERIAL_EVT_OPCODE_ECHO_RSP;
            serial_evt.length = p_serial_cmd->length;
            if (p_serial_cmd->length > 1)
            {
                memcpy(serial_evt.params.echo.data, p_serial_cmd->params.echo.data, p_serial_cmd->length - 1);
            }
            __LOG("Echo. Responding...\n");
            (void) serial_handler_event_send(&serial_evt);
            break;

        case SERIAL_CMD_OPCODE_RADIO_RESET:
            /* Host gets out of sync if we cut off in the middle of a TX */
            serial_wait_for_completion();

            /* kill ourself :) */
#ifdef SOFTDEVICE_PRESENT
            sd_power_reset_reason_clr(0xFFFFFFFF);
#ifdef NRF51
            sd_power_gpregret_set(RBC_MESH_GPREGRET_CODE_FORCED_REBOOT);
#endif
#ifdef NRF52
            sd_power_gpregret_set(0, RBC_MESH_GPREGRET_CODE_FORCED_REBOOT);
#endif
            sd_nvic_SystemReset();
#else
            NRF_POWER->RESETREAS = 0xFFFFFFFF; /* erase reset-reason to avoid wrongful state-readout on reboot */
            NRF_POWER->GPREGRET = RBC_MESH_GPREGRET_CODE_FORCED_REBOOT;
            NVIC_SystemReset();
#endif
            break;
#ifndef BOOTLOADER
        case SERIAL_CMD_OPCODE_INIT:
            serial_evt.opcode = SERIAL_EVT_OPCODE_CMD_RSP;
            serial_evt.params.cmd_rsp.command_opcode = p_serial_cmd->opcode;
            serial_evt.length = 3;

            if (p_serial_cmd->length != sizeof(serial_cmd_params_init_t) + 1)
            {
                serial_evt.params.cmd_rsp.status = ACI_STATUS_ERROR_INVALID_LENGTH;
                error_code = NRF_ERROR_INVALID_LENGTH;
            }
            else
            {
                rbc_mesh_init_params_t init_params;
                init_params.access_addr = p_serial_cmd->params.init.access_addr;
                init_params.channel = p_serial_cmd->params.init.channel;
                init_params.interval_min_ms = p_serial_cmd->params.init.interval_min;
#if defined(S110)
                init_params.lfclksrc = NRF_CLOCK_LFCLKSRC_XTAL_500_PPM;
#elif NRF_SD_BLE_API_VERSION >= 5
                init_params.lfclksrc.source = NRF_CLOCK_LF_SRC_XTAL;
                init_params.lfclksrc.accuracy = NRF_CLOCK_LF_ACCURACY_500_PPM;
#else
                init_params.lfclksrc.source = NRF_CLOCK_LF_SRC_XTAL;
                init_params.lfclksrc.xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_500_PPM;
#endif
                error_code = rbc_mesh_init(init_params);

                serial_evt.params.cmd_rsp.status = error_code_translate(error_code);
            }

            if (error_code == NRF_SUCCESS)
            {
                /* notify application */
                rbc_mesh_event_t app_evt;
                memset(&app_evt, 0, sizeof(app_evt));
                app_evt.type = RBC_MESH_EVENT_TYPE_INITIALIZED;

                serial_evt.params.cmd_rsp.status = error_code_translate(rbc_mesh_event_push(&app_evt));
            }

            serial_handler_event_send(&serial_evt);
            break;

        case SERIAL_CMD_OPCODE_START:
            serial_evt.opcode = SERIAL_EVT_OPCODE_CMD_RSP;
            serial_evt.params.cmd_rsp.command_opcode = p_serial_cmd->opcode;
            serial_evt.length = 3;

            error_code = rbc_mesh_start();
            serial_evt.params.cmd_rsp.status = error_code_translate(error_code);

            serial_handler_event_send(&serial_evt);
            break;

        case SERIAL_CMD_OPCODE_STOP:
            serial_evt.opcode = SERIAL_EVT_OPCODE_CMD_RSP;
            serial_evt.params.cmd_rsp.command_opcode = p_serial_cmd->opcode;
            serial_evt.length = 3;

            error_code = rbc_mesh_stop();
            serial_evt.params.cmd_rsp.status = error_code_translate(error_code);

            serial_handler_event_send(&serial_evt);
            break;

        case SERIAL_CMD_OPCODE_VALUE_SET:
            {
                serial_evt.opcode = SERIAL_EVT_OPCODE_CMD_RSP;
                serial_evt.params.cmd_rsp.command_opcode = p_serial_cmd->opcode;
                serial_evt.length = 3;

                mesh_packet_t* p_packet;
                if (mesh_packet_acquire(&p_packet))
                {
                    const uint8_t data_len = p_serial_cmd->length - 1 - sizeof(rbc_mesh_value_handle_t);

